/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Não foi possível completar a ação";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Volte a tentar mais tarde.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Este formato multimédia não é suportado.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "É possível que este conteúdo esteja danificado.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "Esta aplicação não está autorizada a reproduzir este ficheiro."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Não foi possível abrir";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Não é possível usar este conteúdo multimédia.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Não é possível descodificar";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "O descodificador necessário está ocupado.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Pare ações que descodificam conteúdos e volte a tentar.";
